// 比较两个记录键值的大小，如果这两个记录键值的大小出现逆序，则交换这两个记录

function bubbleSort(arr) {
  for (let i = 1; i < arr.length; i++) {
    for (let j = i; j > 0; j--) {
      if (arr[j] < arr[j - 1]) {
        [arr[j], arr[j - 1]] = [arr[j - 1], arr[j]]
      }
    }
  }
  return arr
}

console.log(bubbleSort([5, 3, 1, 6, 7, 2, 4, 8]))

// i = 1 => [3, 5, 1, 6, 7, 2, 4, 8]
// i = 2 => [1, 3, 5, 6, 7, 2, 4, 8]
// i = 3 => [1, 3, 5, 6, 7, 2, 4, 8]
// i = 4 => [1, 3, 5, 6, 7, 2, 4, 8]
// i = 5 => [1, 2, 3, 5, 6, 7, 4, 8]
// i = 6 => [1, 2, 3, 4, 5, 6, 7, 8]
// i = 7 => [1, 2, 3, 4, 5, 6, 7, 8]
